# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with TSA detection head only
# TSA: 三重尺度自适应检测头 - 基于小目标增强、多尺度融合和自适应对齐的创新检测头

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11-tsa.yaml' will call yolo11-tsa.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone (原版C3k2)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2 - 保持原版C3k2模块
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4 - 保持原版C3k2模块
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]] # 6 - 保持原版C3k2模块
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]] # 8 - 保持原版C3k2模块
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11n head with TSA detection head only
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 13 - 保持原版C3k2模块

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 16 (P3/8-small) - 保持原版C3k2模块

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 19 (P4/16-medium) - 保持原版C3k2模块

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 22 (P5/32-large) - 保持原版C3k2模块

  - [[16, 19, 22], 1, TSADetect, [nc]] # TSA Triple Scale Adaptive Detection head

# 消融实验配置：
# 1. 仅使用TSA检测头，验证三重尺度自适应检测的独立效果
# 2. 保持原版C3k2模块，不使用CMConv和MSAFE
# 3. TSA检测头包含三个核心模块：
#    - Target Enhancement：小目标检测增强，针对微小缺陷的特殊处理
#    - Scale Fusion：多尺度特征融合，增强不同尺度间的信息流动
#    - Adaptive Alignment：自适应特征对齐，解决多尺度特征融合时的对齐问题
